---------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Log\tdcommands_log
> _08-01-2017.log
  log type:  text
 opened on:   1 Aug 2017, 08:53:23

. 
. net install flowchart, replace from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capston
> e\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...
all files already exist and are up to date.

. flowchart debug
 First Variable: debug
 Other Variables:  

. flowchart debug on
 First Variable: debug
 Other Variables:   on

. flowchart debug, on
 First Variable: debug,
 Other Variables:   on

. flowchart debug off
 First Variable: debug
 Other Variables:   off

. flowchart debug logreset
 First Variable: debug
 Other Variables:   logreset

. net install flowchart, replace from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capston
> e\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\f\flowchart.ado

installing into c:\ado\plus\...
installation complete.

. flowchart debug on

. flowchart debug off

. net install flowchart, replace from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capston
> e\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\f\flowchart.ado

installing into c:\ado\plus\...
installation complete.

. flowchart debug off
|||||| DebugLog Off



. net install flowchart, replace from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capston
> e\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\f\flowchart.ado

installing into c:\ado\plus\...
installation complete.

. flowchart debug on
|||||| DebugLog Started: Log ID = 1Aug2017_090248
(note: file C:\Users\Krist\Documents\DebugLog.log not found)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  DebugLog
       log:  C:\Users\Krist\Documents\DebugLog.log
  log type:  text
 opened on:   1 Aug 2017, 09:02:48

. pwd
C:\Users\Krist\Documents

. net install flowchart, replace from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\f\flowchart.ado

installing into c:\ado\plus\...
installation complete.

. flowchart debug off
 First Variable: debug
 Other Variables:   off
|||||| DebugLog Off



. cd C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Log
C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Log

. flowchart debug on
(note: file C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Log\DebugLog.log not found)
-----------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  DebugLog
       log:  C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Log\DebugLog.log
  log type:  text
 opened on:   1 Aug 2017, 09:09:55
|||||| DebugLog Started: Log ID = 1Aug2017_090955

. net install flowchart, replace from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\f\flowchart.ado

installing into c:\ado\plus\...
installation complete.

. flowchart debug off
 First Variable: debug
 Other Variables:   off
|||||| DebugLog Off



. net install flowchart, replace from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\f\flowchart.ado

installing into c:\ado\plus\...
installation complete.

. flowchart debug on
Debugging On.

  Starting DebugLog...

-----------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  DebugLog
       log:  C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Log\DebugLog.log
  log type:  text
 opened on:   1 Aug 2017, 09:12:30

|||||| DebugLog Started: Log ID = 1Aug2017_091230



. flowchart debug off
 First Variable: debug
 Other Variables:   off

|||||| DebugLog Off



. flowchart debug logreset

|||||| DebugLog Closed


...DebugLog reset.

. flowchart debug on
Debugging On.

  Starting DebugLog...

-----------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  DebugLog
       log:  C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Log\DebugLog.log
  log type:  text
 opened on:   1 Aug 2017, 09:14:36

|||||| DebugLog Resumed: Log ID = 1Aug2017_091436


Could not start DebugLog.
r(98);

. display _rc
111

. flowchart init
invalid file specification
r(198);

. net install flowchart, replace from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\f\flowchart.ado

installing into c:\ado\plus\...
installation complete.

. flowchart init
Invalid File Specification: Please specify a subanalysis data file.
      Example: flowchart init using "Methods--Figure-Flowchart.data" 
      Guidance: If the filename has spaces in it, put it in "doublequotes." 
      Help: For more assistance, type "flowchart help"
invalid syntax
r(198);

. net install flowchart, replace from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\f\flowchart.ado

installing into c:\ado\plus\...
installation complete.

. flowchart init
Invalid File Specification: Please specify a subanalysis data file.
      Example: flowchart init using "Methods--Figure-Flowchart.data" 
      Guidance: If the filename has spaces in it, put it in "doublequotes." 
      Help: For more assistance, type "flowchart help"
Invalid File Specification
invalid syntax
r(198);

. net install flowchart, replace from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\f\flowchart.ado

installing into c:\ado\plus\...
installation complete.

. flowchart init
Invalid File Specification: Please specify a subanalysis data file.
      Example: flowchart init using "Methods--Figure-Flowchart.data" 
      Guidance: If the filename has spaces in it, put it in "doublequotes." 
      Help: For more assistance, type "flowchart help"
Invalid File Specification
r(198);

. pwd
C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Log

. display _rc
198

. help pwd

. flowchart init C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Filename With Spaces
Invalid File Specification: Please specify a subanalysis data file.
      Example: flowchart init using "Methods--Figure-Flowchart.data" 
      Guidance: If the filename has spaces in it, put it in "doublequotes." 
      Help: For more assistance, type "flowchart help"
Invalid File Specification
r(198);

. flowchart init C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Filename With Spaces.data
Invalid File Specification: Please specify a subanalysis data file.
      Example: flowchart init using "Methods--Figure-Flowchart.data" 
      Guidance: If the filename has spaces in it, put it in "doublequotes." 
      Help: For more assistance, type "flowchart help"
Invalid File Specification
r(198);

. flowchart debug on
 First Variable: debug
 Other Variables:   on
Debugging On.

  Starting DebugLog...

-----------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  DebugLog
       log:  C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Log\DebugLog.log
  log type:  text
 opened on:   1 Aug 2017, 09:24:36

|||||| DebugLog Resumed: Log ID = 1Aug2017_092436



. flowchart init C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Filename With Spaces.data
Invalid File Specification: Please specify a subanalysis data file.
      Example: flowchart init using "Methods--Figure-Flowchart.data" 
      Guidance: If the filename has spaces in it, put it in "doublequotes." 
      Help: For more assistance, type "flowchart help"
Invalid File Specification
r(198);

. flowchart init "C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Filename With Spaces.data"
Invalid File Specification: Please specify a subanalysis data file.
      Example: flowchart init using "Methods--Figure-Flowchart.data" 
      Guidance: If the filename has spaces in it, put it in "doublequotes." 
      Help: For more assistance, type "flowchart help"
Invalid File Specification
r(198);

. net install flowchart, replace from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\f\flowchart.ado

installing into c:\ado\plus\...
installation complete.

. flowchart init "C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Filename With Spaces.data"
Invalid File Specification: Please specify a subanalysis data file to initiate.
      Example: flowchart init using "Methods--Figure-Flowchart.data" 
      Guidance: If the filename has spaces in it, put it in "doublequotes" 
      Help: For more assistance, type "flowchart help"
Invalid File Specification
r(198);

. net install flowchart, replace from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\f\flowchart.ado

installing into c:\ado\plus\...
installation complete.

. flowchart init "C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Filename With Spaces.data"
Invalid File Specification: Please specify a subanalysis data file to initiate.
      Example: flowchart init using "Methods--Figure-Flowchart.data" 
      Guidance: If the filename has spaces in it, put it in "doublequotes" 
      Help: For more assistance, type "flowchart help"
Invalid File Specification
r(198);

. net install flowchart, replace from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\f\flowchart.ado

installing into c:\ado\plus\...
installation complete.

. flowchart init "C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Filename With Spaces.data"
invalid file specification
r(198);

. flowchart init "C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\FilenameWithoutSpaces.data"
invalid file specification
r(198);

. net install flowchart, replace from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\f\flowchart.ado

installing into c:\ado\plus\...
installation complete.

. flowchart init "C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\FilenameWithoutSpaces.data"
Invalid File Specification: Please specify a subanalysis data file to initiate.
      Example: flowchart init using "Methods--Figure-Flowchart.data" 
      Guidance: If the filename has spaces in it, put it in "doublequotes" 
      Help: For more assistance, type "flowchart help"
Invalid File Specification
r(198);

. flowchart init using "C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Filename With Spaces.data"
Invalid File Specification: Please specify a subanalysis data file to initiate.
      Example: flowchart init using "Methods--Figure-Flowchart.data" 
      Guidance: If the filename has spaces in it, put it in "doublequotes" 
      Help: For more assistance, type "flowchart help"
Invalid File Specification
r(198);

. flowchart init using "C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\FilenameWithoutSpaces.data"
Invalid File Specification: Please specify a subanalysis data file to initiate.
      Example: flowchart init using "Methods--Figure-Flowchart.data" 
      Guidance: If the filename has spaces in it, put it in "doublequotes" 
      Help: For more assistance, type "flowchart help"
Invalid File Specification
r(198);

. net install flowchart, replace from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\f\flowchart.ado

installing into c:\ado\plus\...
installation complete.

. flowchart init using "C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\FilenameWithoutSpaces.data"
(note: file C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\FilenameWithoutSpaces.data not found)

. net install flowchart, replace from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\f\flowchart.ado

installing into c:\ado\plus\...
installation complete.

. flowchart debug on
 First Variable: debug
 Other Variables:   on
Debugging On.

  Starting DebugLog...

-----------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  DebugLog
       log:  C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Log\DebugLog.log
  log type:  text
 opened on:   1 Aug 2017, 09:36:45

|||||| DebugLog Resumed: Log ID = 1Aug2017_093645



. flowchart init using "C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\FilenameWithoutSpaces.data"
0
0

. flowchart init using "C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\FilenameWithoutSpaces.data"
0
0

. flowchart init using "C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Filename With Spaces.data"
0
(note: file C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Filename With Spaces.data not found)
0

. net install flowchart, replace from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\f\flowchart.ado

installing into c:\ado\plus\...
installation complete.

. flowchart debug on
 First Variable: debug
 Other Variables:   on
Debugging On.

  Starting DebugLog...

-----------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  DebugLog
       log:  C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Log\DebugLog.log
  log type:  text
 opened on:   1 Aug 2017, 09:37:44

|||||| DebugLog Resumed: Log ID = 1Aug2017_093744



. flowchart init using "C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Filename With Spaces.data"
0
0

. flowchart init using "C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\FilenameWithoutSpaces.data"
0
0

. flowchart init using C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\FilenameWithoutSpaces.data
0
0

. flowchart init using C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Filename With Spaces.data
invalid 'With' 
r(198);

. flowchart init C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Filename With Spaces.data
0
invalid file specification
198
file handle FlowchartFile not found
r(111);

. flowchart init C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Filename With Spaces.data
file handle FlowchartFile not found
111
invalid file specification
198
file handle FlowchartFile not found
r(111);

. flowchart init using C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Filename With Spaces.data
invalid 'With' 
r(198);

. flowchart init using "C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Filename With Spaces.data"
file handle FlowchartFile not found
111
0

. help confirm

. net install flowchart, replace from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\f\flowchart.ado

installing into c:\ado\plus\...
installation complete.

. flowchart init using "C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Filename With Spaces.data"
0
0

. flowchart init using C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\FilenameWithoutSpaces.data
0
0

. flowchart init using C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Filename With Spaces.data
invalid 'With' 
r(198);

. help filenaming conventions

. help filename

. net search flowchart
(contacting http://www.stata.com)
no matches

. net describe flowchart, from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart")

-----------------------------------------------------------------------------------------------------------------------------------------------------------------
package flowchart from C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart
-----------------------------------------------------------------------------------------------------------------------------------------------------------------

TITLE
      'FLOWCHART': Generates subject disposition flow diagram figures in LaTeX using PGF/TikZ to include in manuscripts

DESCRIPTION/AUTHOR(S)
      
      Distribution-Date: 20170731
      
      Requires: texdoc, at least Stata v13
      
      Author:  Isaac M. E. Dodd
      Support: github.com/IsaacDodd
      p flowchart Download the Flowchart package.

INSTALLATION FILES                            (type net install flowchart)
      flowchart.ado
      flowchart.sthlp

ANCILLARY FILES                               (type net get flowchart)
      figure-flowchart.texdoc
      example.do
      Manuscript.tex
      Methods--Figure-Flowchart.data
      Methods--Figure-Flowchart.tikz
-----------------------------------------------------------------------------------------------------------------------------------------------------------------

. net install flowchart, replace
checking flowchart consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\f\flowchart.ado
    c:\ado\plus\f\flowchart.sthlp

installing into c:\ado\plus\...
installation complete.

. net get flowchart
checking flowchart consistency and verifying not already installed...

copying into current directory...
      copying  figure-flowchart.texdoc
      copying  example.do
      copying  manuscript.tex
      copying  methods--figure-flowchart.data
      copying  methods--figure-flowchart.tikz
ancillary files successfully copied.

. pwd
C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Log

. flowchart setup

COMMAND PARSING: 
Subcommand via GetToken: 
Subcommand via Syntax: setup
Subcommand with Parameter:  setup
Compound Quotes (CQ's):  
Subparameter via String Parse (CQs):  setu
Subcommand via String Parse (CQs):  

. net install flowchart, replace
checking flowchart consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\f\flowchart.ado

installing into c:\ado\plus\...
installation complete.

. flowchart setup
 First Variable: setup
 Other Variables:  
|||||| Setup
Installing 'texdoc'...
...Texdoc installed successfully.
Setup complete.

. net get flowchart, replace
file http://fmwww.bc.edu/repec/bocode/t/flowchart.pkg not found
could not load flowchart.pkg from http://fmwww.bc.edu/repec/bocode/t/
r(601);

. net get flowchart
file http://fmwww.bc.edu/repec/bocode/t/flowchart.pkg not found
could not load flowchart.pkg from http://fmwww.bc.edu/repec/bocode/t/
r(601);

. net describe flowchart, from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart")

-----------------------------------------------------------------------------------------------------------------------------------------------------------------
package flowchart from C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart
-----------------------------------------------------------------------------------------------------------------------------------------------------------------

TITLE
      'FLOWCHART': Generates subject disposition flow diagram figures in LaTeX using PGF/TikZ to include in manuscripts

DESCRIPTION/AUTHOR(S)
      
      Distribution-Date: 20170731
      
      Requires: texdoc, at least Stata v13
      
      Author:  Isaac M. E. Dodd
      Support: github.com/IsaacDodd

INSTALLATION FILES                            (type net install flowchart)
      flowchart.ado
      flowchart.sthlp

ANCILLARY FILES                               (type net get flowchart)
      figure-flowchart.texdoc
      example.do
      Manuscript.tex
      Methods--Figure-Flowchart.data
      Methods--Figure-Flowchart.tikz
-----------------------------------------------------------------------------------------------------------------------------------------------------------------

. net get flowchart, from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...

copying into current directory...
      copying  figure-flowchart.texdoc
      copying  example.do
      copying  manuscript.tex
      copying  methods--figure-flowchart.data
      copying  methods--figure-flowchart.tikz
ancillary files successfully copied.

. net get flowchart, from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...
all files already exist and are up to date.

. net install flowchart, from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart") replace
checking flowchart consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\f\flowchart.ado

installing into c:\ado\plus\...
installation complete.

. net install flowchart, from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart") replace
checking flowchart consistency and verifying not already installed...
all files already exist and are up to date.

. flowchart debug off
 First Variable: debug
 Other Variables:   off

|||||| DebugLog Off



. do "C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Log\example.do"

. ********************
. * EXAMPLE:
. ********************
. 
. * DISPOSITION SUBANALYSIS: Analyze and setup the subject disposition.
. 
.         *** Subanalysis Data is performed here where the numbers and data to produce the flowchart are created. 
.         *** Rows can be created using macros to fill in each row as the data for the analysis are changed.
. 
. * DIAGRAM: Call Post-Production texdoc file to write this analysis as a diagram.
.         * All files are relative to the current working directory.
. 
. flowchart init using "Methods--Figure-Flowchart.data"

. 
. flowchart writerow(enrollment): ///
>         "referred" 173 "Referred", ///
>         "referred_excluded" 17 "Excluded" ///
>         "referred_excluded_nopartic" 9 "a) Did not wish to participate" ///
>         "referred_excluded_noshow" 5 "b) Did not show for interview" ///
>         "referred_excluded_other" 3 "c) Other reasons"

.         
. flowchart writerow(assessment): ///
>         "assessed" 156 "Assessed for Eligibility", ///
>         "assessed_excluded" 54 "Excluded" ///
>         "assessed_excluded_inclusioncritunmet" 22 "a) Inclusion criteria not met" ///
>         "assessed_excluded_exclusioncritmet" 13 "b) Exclusion criteria met" ///
>         "assessed_excluded_unsuitedgroup" 7 "c) Not suited for waitlist group" ///
>         "assessed_excluded_unsuitedtx" 2 "d) Not suited for intervention" ///
>         "assessed_excluded_othertx" 3 "e) Sought other treatment" ///
>         "assessed_excluded_other" 7 "f) Other reasons"

.         
. flowchart_debug, off
unrecognized command:  flowchart_debug
r(199);

end of do-file

r(199);

. do "C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart\example.do"

. ********************
. * EXAMPLE:
. ********************
. 
. * DISPOSITION SUBANALYSIS: Analyze and setup the subject disposition.
. 
.         *** Subanalysis Data is performed here where the numbers and data to produce the flowchart are created. 
.         *** Rows can be created using macros to fill in each row as the data for the analysis are changed.
. 
. * DIAGRAM: Call Post-Production texdoc file to write this analysis as a diagram.
.         * All files are relative to the current working directory.
.         
. * This file is a part of the ancillary files that come with flowchart (installed by typing 'net get flowchart').
. *       By default it installs to the working directory at the time that the 'net get' command is run. 
. * Instructions: Run this do file from the do editor by hitting Ctrl + D (or Cmd + D on a mac) in the same directory as the ancillary files.
. 
. flowchart init using "methods--figure-flowchart.data"

. 
. flowchart writerow(enrollment): ///
>         "referred" 173 "Referred", ///
>         "referred_excluded" 17 "Excluded" ///
>         "referred_excluded_nopartic" 9 "a) Did not wish to participate" ///
>         "referred_excluded_noshow" 5 "b) Did not show for interview" ///
>         "referred_excluded_other" 3 "c) Other reasons"

.         
. flowchart writerow(assessment): ///
>         "assessed" 156 "Assessed for Eligibility", ///
>         "assessed_excluded" 54 "Excluded" ///
>         "assessed_excluded_inclusioncritunmet" 22 "a) Inclusion criteria not met" ///
>         "assessed_excluded_exclusioncritmet" 13 "b) Exclusion criteria met" ///
>         "assessed_excluded_unsuitedgroup" 7 "c) Not suited for waitlist group" ///
>         "assessed_excluded_unsuitedtx" 2 "d) Not suited for intervention" ///
>         "assessed_excluded_othertx" 3 "e) Sought other treatment" ///
>         "assessed_excluded_other" 7 "f) Other reasons"

. 
. flowchart writerow(random): "randomized" 102 "Randomized", flowchart_blank // Blank Row

. 
. flowchart writerow(allocgroup): ///
>         "alloc_interventiongroup" 51 "Allocated to Intervention group", ///
>         "alloc_waitlistgroup" 51 "Allocated to Wait-list control group"

. 
. flowchart writerow(allocdetails): ///
>         "intervention_received" 49 "Received intervention" ///
>         "intervention_unreceived" 2 "Did not receive intervention" ///
>         "intervention_unreceived_exclusioncrit" 1 "With exclusionary criteria" ///
>         "intervention_unreceived_notime" 1 "Could not find time to participate", ///
>         "waitlist_stayedon" 48 "Stayed on wait-list" ///
>         "waitlist_didnotstay" 3 "Did not stay on wait-list" ///
>         "waitlist_didnotstay_selfinduced" 2 "Lost motivation" ///
>         "waitlist_didnotstay_leftarea" 1 "Was offered treatment elsewhere"

.         
. flowchart writerow(postmeasurement): ///
>         "postintervention_lost" 5 "Post-intervention measurement" ///
>         "postintervention_lost_droppedout" 2 "Dropped out of the intervention" ///
>         "postintervention_lost_nomeasurement" 3 "Did not complete measurement", ///
>         "postwaitlist_lost" 6 "Post-wait-list measurement" ///
>         "postwaitlist_lost_droppedout" 3 "Dropped out of the wait-list" ///
>         "postwaitlist_lost_nomeasurement" 3 "Did not complete measurement" ///
>         

. flowchart writerow(wlistintervention): flowchart_blank, ///     
>         "postwaitlist_intervention_allocated" 48 "Allocated to intervention" ///
>         "postwaitlist_intervention_received" 46 "Received intervention" ///
>         "postwaitlist_intervention_didnotreceive" 2 "Did not receive intervention" ///
>         "postwaitlist_intervention_dnr_lowmotivation" 1 "Reported low motivation" ///
>         "postwaitlist_intervention_dnr_notime" 1 "Could not find time to participate"

.         
. flowchart writerow(measurement3monpostint): ///
>         "intervention_3monthfollowup" 9 "3-months follow-up measurement: \\ \h Loss to follow-up", ///
>         "postwaitlist_postintervention_losstofollowup" 5 "Post-intervention measurement: \\ \h Loss to follow-up" ///
>         "postwaitlist_postintervention_losstofollowup_droppedout" 2 "Dropped out of the intervention" ///
>         "postwaitlist_postintervention_losstofollowup_incomplete" 3 "Did not complete measurement"

. 
. flowchart writerow(wlist3mon): flowchart_blank, ///
>         "postwaitlist_3monthfollowup" 2 "3-months follow-up measurement \\ \h Did not complete measurement"

.         
. flowchart writerow(analyzed): ///
>         "intervention_analyzed" 51 "Analyzed in Intervention group", ///
>         "postwaitlist_analyzed" 51 "Analyzed in Wait-list control group"

. 
. flowchart connect enrollment_center enrollment_left

. flowchart connect enrollment_center assessment_center

. flowchart connect assessment_center assessment_left

. flowchart connect assessment_center random_center

. flowchart connect random_center allocgroup_center

. flowchart connect random_center allocgroup_left, arrow(angled)

. flowchart connect allocgroup_center allocdetails_center

. flowchart connect allocgroup_left allocdetails_left

. flowchart connect allocdetails_center postmeasurement_center

. flowchart connect allocdetails_left postmeasurement_left

. flowchart connect postmeasurement_center measurement3monpostint_center

. flowchart connect measurement3monpostint_center analyzed_center

. flowchart connect postmeasurement_left wlistintervention_left

. flowchart connect wlistintervention_left measurement3monpostint_left

. flowchart connect measurement3monpostint_left wlist3mon_left

. flowchart connect wlist3mon_left analyzed_left 

. 
. flowchart finalize, input("figure-flowchart.texdoc") output("methods--figure-flowchart.tikz")

. texdoc init `"methods--figure-flowchart.tikz"'
(texdoc output file is methods--figure-flowchart.tikz)

. /* DO NOT EDIT THIS DOCUMENT: This file is used to automatically generate the TikZ picture using texdoc. */
. 
. texdoc local settings_substitutions = `"$Flowchart_Settings"'
(no stlog available; skipping backup)

. 
. texdoc substitute `settings_substitutions'

. 
. texdoc append_snippet 2

. 
. /* To Do: Future Releases: Implement row-options - 'flowchart writerow(rowname,rowoption): ...' -- Allow noborder, assign, and lost-style boxes.
>      block_noborder/.style ={rectangle, draw=@set_noborder_draw, thick, fill=@set_noborder_fill,
>        text width=@set_noborder_textwidth, text @set_noborder_textalign, minimum height=@set_noborder_minheight},
>      block_assign/.style ={rectangle, draw=@set_draw, thick, fill=@set_fill,
>        text width=@set_assign_textwidth, text @set_assign_textalign, minimum height=@set_assign_minheight, inner sep=@set_assign_innersep},
>      block_lost/.style ={rectangle, draw=@set_draw, thick, fill=@set_fill,
>        text width=@set_lost_textwidth, text @set_lost_textalign, minimum height=@set_lost_minheight, inner sep=@set_lost_innersep},
> */
. 
. texdoc write    % Outlining the flowchart using the PGF/TikZ matrix function

. 
. texdoc write    \matrix [column sep=15mm,row sep=3mm] {

. 
. forval index=1/`=`.blockfields.list.arrnels'' {
  2.         texdoc write `.blockfields.list[`index']'
  3. }

.         
. texdoc write    };% End Matrix

. 
. texdoc write    % Connecting nodes with paths

. texdoc write    \begin{scope}[every path/.style=line]

. 
. forval index=1/`=`.pathfields.list.arrnels'' {
  2.         texdoc write `.pathfields.list[`index']'
  3. }

. 
. texdoc write    \end{scope}

. texdoc write \end{tikzpicture}

. 
end of do-file
(texdoc output written to methods--figure-flowchart.tikz)
(texdoc not initialized; nothing to do)

. 
. /*
> * TESTS: Uncomment the following lines to run tests. Alternatively, use this as a template to follow:
> flowchart init using "filename.data"
> 
> * |||||| TEST1: Dummy Row
> flowchart writerow(rownametest1): "lblock1_line1" 46 "This is one line, \\ of a block." ///
>         "lblock1_line2" 43 "This is another line, of a block" ///
>         "lblock1_line3" 3 "This is another line, of a block", ///
>         "rblock1_line1" 97 "This is one line, of a block." ///
>         "rblock1_line2" 33 "This is another line, of a block" ///
>         "rblock1_line3" 44 "This is another line, of a block"
> 
> * |||||| TEST2: Row with No left-block
> flowchart writerow(rownametest2): flowchart_blank, ///
>         "rblock1_line1" 97 "This is one line, of a block." ///
>         "rblock1_line2" 33 "This is another line, of a block" ///
>         "rblock1_line3" 44 "This is another line, of a block"
> 
> * |||||| TEST3: Row with No right-block
> flowchart writerow(rownametest3): "lblock1_line1" 46 "This is one line, \\ of a block." ///
>         "lblock1_line2" 43 "This is another line, of a block" ///
>         "lblock1_line3" 3 "This is another line, of a block", flowchart_blank
> 
> * |||||| TEST4: Row with No left-block and a Singleton Lead-Line in the right-block
> flowchart writerow(rownametest4): flowchart_blank, "rblock1_line1" 97 "This is one line, \\ of a block."
>         
> * |||||| TEST5: Row with Singleton Lead-Line in the left-block and No right-block
> flowchart writerow(rownametest5): "lblock1_line1" 46 "This is one line, \\ of a block.", flowchart_blank
> 
> flowchart connect rownametest1_center rownametest1_left
> flowchart connect rownametest1_left rownametest2_left
> flowchart connect rownametest1_center rownametest3_center
> flowchart connect rownametest3_center rownametest5_center
> flowchart connect rownametest2_left rownametest4_left
> 
> flowchart finalize, input("figure.texdoc") output("figure.tikz")
> */
. 
end of do-file

. net describe flowchart, from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart")

-----------------------------------------------------------------------------------------------------------------------------------------------------------------
package flowchart from C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart
-----------------------------------------------------------------------------------------------------------------------------------------------------------------

TITLE
      'FLOWCHART': Generates subject disposition flow diagram figures in LaTeX using PGF/TikZ to include in manuscripts

DESCRIPTION/AUTHOR(S)
      
      Distribution-Date: 20170731
      
      Requires: texdoc, at least Stata v13
      
      Author:  Isaac M. E. Dodd
      Support: github.com/IsaacDodd
      p flowchart

INSTALLATION FILES                            (type net install flowchart)
      flowchart.ado
      flowchart.sthlp

ANCILLARY FILES                               (type net get flowchart)
      figure-flowchart.texdoc
      example.do
      example2.do
      Manuscript.tex
      Methods--Figure-Flowchart.data
      Methods--Figure-Flowchart.tikz
      license.txt
-----------------------------------------------------------------------------------------------------------------------------------------------------------------

. help sthlp

. help examplehelpfile.sthlp

. help examplehelpfile

. viewsource examplehelpfile.sthlp

. net install flowchart, replace from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\f\flowchart.ado
    c:\ado\plus\f\flowchart.sthlp

installing into c:\ado\plus\...
installation complete.

. help flowchart

. help flowchart

. net install flowchart, replace from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\f\flowchart.sthlp

installing into c:\ado\plus\...
installation complete.

. help flowchart

. net install flowchart, replace from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\f\flowchart.sthlp

installing into c:\ado\plus\...
installation complete.

. help flowchart

. net install flowchart, replace from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\f\flowchart.sthlp

installing into c:\ado\plus\...
installation complete.

. help flowchart

. net install flowchart, replace from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\f\flowchart.sthlp

installing into c:\ado\plus\...
installation complete.

. help flowchart

. help

. help flowchart

. net install flowchart, replace from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\f\flowchart.sthlp

installing into c:\ado\plus\...
installation complete.

. help flowchart

. net install flowchart, replace from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\f\flowchart.sthlp

installing into c:\ado\plus\...
installation complete.

. help flowchart

. net install flowchart, replace from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\f\flowchart.sthlp

installing into c:\ado\plus\...
installation complete.

. help flowchart

. net install flowchart, replace from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\f\flowchart.sthlp

installing into c:\ado\plus\...
installation complete.

. help flowchart

. net install flowchart, replace from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\f\flowchart.sthlp

installing into c:\ado\plus\...
installation complete.

. help flowchart

. net install flowchart, replace from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\f\flowchart.sthlp

installing into c:\ado\plus\...
installation complete.

. help flowchart

. net install flowchart, replace from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\f\flowchart.sthlp

installing into c:\ado\plus\...
installation complete.

. help flowchart

. help flowchart

. net install flowchart, replace from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\f\flowchart.sthlp

installing into c:\ado\plus\...
installation complete.

. help flowchart

. net install flowchart, replace from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\f\flowchart.sthlp

installing into c:\ado\plus\...
installation complete.

. help flowchart

. net install flowchart, replace from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\f\flowchart.sthlp

installing into c:\ado\plus\...
installation complete.

. help flowchart

. net install flowchart, replace from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\f\flowchart.sthlp

installing into c:\ado\plus\...
installation complete.

. help flowchart

. net install flowchart, replace from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\f\flowchart.sthlp

installing into c:\ado\plus\...
installation complete.

. help flowchart

. net install flowchart, replace from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\f\flowchart.sthlp

installing into c:\ado\plus\...
installation complete.

. help flowchart

. net install flowchart, replace from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\f\flowchart.sthlp

installing into c:\ado\plus\...
installation complete.

. help flowchart

. net install flowchart, replace from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\f\flowchart.sthlp

installing into c:\ado\plus\...
installation complete.

. help flowchart

. net install flowchart, replace from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\f\flowchart.sthlp

installing into c:\ado\plus\...
installation complete.

. help flowchart

. net install flowchart, replace from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...
all files already exist and are up to date.

. help flowchart

. net install flowchart, replace from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\f\flowchart.sthlp

installing into c:\ado\plus\...
installation complete.

. help flowchart

. net install flowchart, replace from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\f\flowchart.sthlp

installing into c:\ado\plus\...
installation complete.

. help flowchart

. help flowchart

. net install flowchart, replace from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\f\flowchart.sthlp

installing into c:\ado\plus\...
installation complete.

. help flowchart

. net install flowchart, replace from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\f\flowchart.sthlp

installing into c:\ado\plus\...
installation complete.

. help flowchart

. net install flowchart, replace from("C:\Users\Krist\Desktop\Isaac\JHSPH\Capstone\Stata\Do\flowchart")
checking flowchart consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\f\flowchart.sthlp

installing into c:\ado\plus\...
installation complete.

. help flowchart

